label ch0:

    scene bg adofai with fade

    '作为一个二线城市普通家庭的学生，\n{w=0.5}你比大多数人更容易接触到一些新潮的事物。'
    '同样的，{w=0.25}作为一个二线城市普通家庭的学生，\n{w=0.5}你的一些爱好往往并不能找到与你志同道合的伙伴。'
    '你不是一个外向的学生，{w=0.5}只是一个班里的小透明。'
    '有着普通的父母，{w=0.5}住着普通的房子，{w=0.5}上着普通的学校，{w=0.5}学习也普普通通。'
    '不是什么大家口里的坏孩子，{w=0.5}但也不是别人家长口中的“别人家的孩子”。'
    '日子{w=0.25}就这么普普通通的过着。'
    '{cps=*0.25}......{/cps}'

    scene bg adofai with fade
    
    $ renpy.notify('2020年某日')
    pause 1.0

    '你偶然在某个视频网站上遇到了一款游戏。'
    '只需一个按键，{w=0.5}控制盘旋飞舞的双星，{w=0.5}踏着摇曳的舞步，\n{w=0.5}在一条跟随音乐节奏变化的蜿蜒道路上不断前进，{w=0.5}探索音乐的宇宙。'
    '你突然很想尝试一下，{w=0.5}不过你身无分文。'
    '最终，{w=0.25}你一点点跟着网上的教程下载了{a=https://store.steampowered.com/}Steam{/a}，\n{w=0.5}又偷偷用父母的信用卡笨拙地按照指示付了款。'
    '游戏并不贵，{w=0.5}22元人民币，\n{w=0.5}但对于只在父母手机上玩过一些免费小游戏的你来说，{w=0.5}依然是一笔巨款。'
    '当然，{w=0.25}你父母最终知道了这件事，\n{w=0.5}不过他们并没有斥责你，{w=0.5}经过一番简单的谈话后便原谅了你的行为。'
    '诚然，{w=0.25}对你的父母来说，{w=0.5}他们并不觉得你会误入歧途，\n{w=0.5}但也没在你身上看见光宗耀祖的可能。'
    '你也没在学校里大肆宣传这个游戏，\n{w=0.5}即使偶尔和几个关系近的同学提起，{w=0.5}他们也不感兴趣。'
    '日子{w=0.25}依旧普普通通的过着。'
    '{cps=*0.25}......{/cps}'
    # '{cps=*0.5}直到{w=0.25}有一天......{/cps}'

    scene bg adofai with fade

    $ renpy.notify('2022年某日，哔哩哗哩评论区')
    pause 1.0
    
    '就像之前的每一天一样，{w=0.5}你百无聊赖的刷着B站。'
    '随着又一次刷新，{w=0.25}主页上跳出一张封面简陋得如同小孩子简笔画的视频，\n{w=0.5}标题里的“冰与火之舞”五个字勾起了你的兴趣。'
    '作为一个已经断断续续玩过两年的玩家，\n{w=0.5}你也大致掌握了这款游戏的玩法，\n{w=0.5}并取得了一些你自认为满意的记录。'
    '平时，{w=0.25}你也会在视频网站上消磨时间。'
    '有时看到一个高难谱面的通关或一张精美的特效作品，\n{w=0.5}你会毫不吝啬的在评论区表达你的赞美之情；'
    '有时看见一名新人入坑，\n{w=0.5}你也会在评论区鼓励一番。'
    '虽然仍不是什么著名人物，{w=0.5}但你在网络上也算是有了点名气。'
    '不过这次的风格，{w=0.5}{cps=*0.5}你从未见过。{/cps}'
    '{cps=*0.5}怀着好奇心，{w=0.5}你点开了{/cps}{w=0.25}{cps=*0.25}{a=https://www.bilibili.com/video/BV1H54y1k7u2/}那个视频{/a}。{/cps}'
    mc '{cps=*0.25}............{/cps}{nw}'
    mc '............{fast}这啥玩意...？'
    '你感觉像是被人{w=0.5}{cps=*0.25}喂了一口屎。{/cps}'
    yangsy '咱就是说这话是不是有点太糙了啊喂（'
    '显然，{w=0.25}这是一个外网的转载视频。'
    '画面中，{w=0.25}你熟悉的一个个关卡被扭曲成了某种奇异而搞笑的风格，\n{w=0.5}加入了各种奇奇怪怪的机制。'
    '看着这一个个被魔改的面目全非的关卡，\n{w=0.5}你的心情从疑惑，{w=0.5}无语，{w=0.5}到愤怒，{w=0.5}再到平静。'
    '到了快结束的时候，{w=0.5}你甚至不受控制地{w=0.25}{nw}'
    '到了快结束的时候，你甚至不受控制地{fast}笑了一下。'
    '显然，{w=0.5}你已经彻底理解了这种“特立独行”的艺术。'
    '按照惯例，{w=0.25}你发表了一条评论：'
    mc '{cps=*0.5}做出这个东西的人{w=0.5}{b}一定{/b}{w=0.25}是个天才。{/cps}'
    # yoosee '这一句我觉得不满意，后面要改'
    '{cps=*0.25}......{/cps}'

    scene bg adofai with fade

    # $ renpy.notify('几天之后')
    # pause 1.0

    '几天之后，{w=0.5}你的评论{w=0.5}收到了一条回复。'
    '{cps=*0.5}故事，{w=0.5}就从这{w=0.25}开始了。{/cps}'
    
    yangsy '...或许可以插入那条回复的具体内容？（{w}以及所以这条评论到底是谁发的？（（'

    scene bg adofai with fade

    gra '（占位符文本）'

    scene black with dissolve
    return