label ch1:
    scene bg that_video with fade
    "你发现视频简介里有群号，\n{w=0.5}于是就用父母的手机号注册了一个QQ，{w=0.5}发送了入群申请。"
    "在等待回复的时候，{w=0.5}你顺便看了这位UP的其他视频。"
    mc "这螃蟹有意思"
    "你发现，{w=0.25}这些“被扭曲成某种奇异而搞笑的风格关卡”有一个统称：{w=0.5}{cps=*0.125}{rb}魔改关卡{/rb}{rt}Cursed Levels{/rt}{/cps}。"
    "没花多久时间，你就把这些视频全都看了一遍。"
    "你发现不同的螃蟹对应着不同的效果，{w=0.5}因此将它们全部记了下来，{w=0.5}以便不时之需。"
    scene bg adofai with fade
    "{......}突然响起的QQ提示音将你的意识从虚无中拉回现实。"
    "等待了将近一个小时的你{w=0.25}此时已经迫不及待了。"
    "你满怀期特地打开了QQ——{nw}"
    "{cps=*0.25}群主拒绝了你的入群申请{/cps}"
    mc "{......}{w=0.5}为什么会这样？"
    "不信邪的你又发了一遍入群申请，{w=0.5}这次的提示音很快就出现了。"
    "QQ的群聊一栏也多了一个叫“Grafrustix的聊天群”的群。\n{w=1.0}你点进群，{w=0.5}很快就看到了第一条消息："
    gra "抱歉啊，{w=0.25}刚刚不小心点错了\[笑哭\]"
    "你笨拙地找着输入消息的地方，\n{w=1.0}笨拙地打着字，\n{w=0.5}最后艰难的挤出一条消息："
    mc "没关系的"
    gra "觉得有兴趣可以进群里玩哦\[doge\]"
    "你又笨拙的发送了一条消息："
    mc "那个，{w=0.25}你能介绍下你是谁吗，{w=0.5}我该怎么称呼您?"
    gra "不用这么恭敬的啦，{w=0.5}我是Grafrustix，{w=0.5}叫我晴柚也行"
    gra "那么你叫什么{w=0.5}{nw}"
    $ _history_list.pop()
    if name_mc == "奥苯海墨与孙笑氚发明了铅早砹音和丰氚箱子":
        menu:
            gra "那么你叫什么{fast}"
            "[name_mc]":
                mc "我叫[name_mc]"
        gra "你这个名字很有个性啊。{w=1.0}我感觉你很适合做魔改啊"
    else:
        menu:
            gra "那么你叫什么{fast}"
            "[name_mc]":
                mc "我叫[name_mc]"
            "奥苯海墨与孙笑氚发明了铅早砹音和丰氚箱子":
                mc "我叫奥苯海墨与孙笑氚发明了铅早砹音和丰氚箱子"
                gra "？\n{w=0.5}有想法。{w=1.0}我感觉你很适合做魔改啊\n{w=1.0}不过你不叫这个吧"
                gra "我到底怎么叫你{w=0.5}{nw}"
                menu:
                    gra "我到底怎么叫你{fast}"
                    "[name_mc]":
                        mc "我叫[name_mc]"       
    gra "行，{w=0.25}[name_mc]{w=0.5}，就这么叫你了。"
    mc "Gra，{w=0.25}这个魔改到底是什么能给我讲讲吗？{w=1.0}还有QQ怎么用\[笑哭\]"
    "Gra 耐心地跟你解释各种事情：\n{w=1.0}什么是魔改，{w=0.5}QQ怎么用，{w=0.5}以及关于QQ群聊的一些信息{...}"
    "你还了解到，{w=0.5}Gra 也是一名魔改作者，{w=0.5}群里还有好几位像 Gra 一样的魔改作者。"
    "你本来还想了解诸如“该怎么做魔改”之类的更多信息——{w=0.5}但你母亲却已经在催你去睡觉了。"
    mc "Gra，{w=0.25}我先不聊了，{w=0.5}我母亲叫我睡觉了"
    gra "祝你好梦"
    "你躺在床上回想今天发生的一切，{w=0.5}心中充满了干劲，{w=0.5}很快就进入了梦乡。"
    "窗外繁星点点，{w=0.5}或许{w=0.25}象征着天数个明天吧。"
    return