label ch1:
    scene bg that_video with fade
    if has_phone:
        "你使用在视频简介里发现的群号找到了群。"
    else:
        "你用父母的手机号注册了一个QQ，{w=0.5}使用在视频简介里发现的群号找到了群。"
    
    menu:
        "要加群吗？"
        "加群":
            pass
        "不加群":
            jump chex0_not_join

    "你发送了入群申请。"
    "在等待回复的时候，{w=0.5}你顺便看了这位UP的其他视频。"
    mc "这螃蟹有意思"
    "你发现，{w=0.25}这些“被扭曲成某种奇异而搞笑的风格关卡”有一个统称：{w=0.5}{cps=*0.125}{rb}魔改关卡{/rb}{rt}Cursed Levels{/rt}{/cps}。"
    "没花多久时间，你就把这些视频全都看了一遍。"
    "你发现不同的螃蟹对应着不同的效果，{w=0.5}因此将它们全部记了下来，{w=0.5}以便不时之需。"
    scene bg adofai with fade
    "{......}突然响起的QQ提示音将你的意识从虚无中拉回现实。"
    "等待了将近一个小时的你{w=0.25}此时已经迫不及待了。"
    "你满怀期特地打开了QQ——{nw}"
    "{cps=*0.25}群主拒绝了你的入群申请{/cps}"
    mc "{......}{w=0.5}为什么会这样？"

    menu:
        "再加一遍？"
        "是":
            pass
        "否":
            jump chex0_not_join

    "不信邪的你又发了一遍入群申请——{w=0.5}这次的提示音倒是没过多久就出现了。"
    "QQ的群聊一栏多出了个名叫“Grafrustix的聊天群”的群。\n{w=1.0}你点进群内，{w=0.5}很快就看到了第一条消息："
    nvl clear
    gra.nvl "抱歉啊，{w=0.25}刚刚不小心点错了[[笑哭]"
    if has_phone:
        "你很快就回复了："
    else:
        "你笨拙地找着输入消息的地方，\n{w=0.5}笨拙地打着字，\n{w=0.5}最后{w=0.25}艰难的挤出一条消息："
    mc.nvl "没关系的{w=0.5}{nw}"
    gra.nvl "觉得有兴趣可以进群里玩哦[[doge]"
    if not has_phone:
        "你又笨拙的发送了一条消息："
    mc.nvl "那个，{w=0.25}你能介绍下你是谁吗，{w=0.5}我该怎么称呼您？"
    gra.nvl "不用这么恭敬的啦{w=1.0}{nw}"
    gra.nvl "我是Grafrustix{w=0.5}{nw}"
    gra.nvl "叫我晴柚也行{w=1.0}{nw}"
    gra.nvl "所以 你叫什么"
    if name_mc == "奥苯海墨与孙笑氚发明了铅早砹音和丰氚箱子":
        menu:
            "[name_mc]":
                mc.nvl "我叫[name_mc]"
        gra.nvl "你这个名字很有个性啊{w=1.0}{nw}"
        gra.nvl "我感觉你很适合做魔改啊"
    else:
        menu:
            "[name_mc]":
                mc.nvl "我叫[name_mc]"
            "奥苯海墨与孙笑氚发明了铅早砹音和丰氚箱子":
                mc.nvl "我叫奥苯海墨与孙笑氚发明了铅早砹音和丰氚箱子"
                gra.nvl "？{w=1.0}{nw}"
                gra.nvl "有想法{w=0.5}{nw}"
                gra.nvl "我感觉你很适合做魔改啊{w=1.0}{nw}"
                gra.nvl "不过你不叫这个吧？{w=1.0}我到底怎么叫你？"
                menu:
                    "[name_mc]":
                        mc.nvl "我叫[name_mc]"       
    gra.nvl "行，就这么叫你了"
    mc.nvl "Gra，{w=0.25}这个魔改到底是什么，{w=0.5}能给我讲讲吗？{w=1.0}{nw}"
    if not has_phone:
        mc.nvl "还有QQ怎么用[[笑哭]"
    "{......}"
    if has_phone:
        "Gra 耐心地跟你解释了各种事情：\n{w=1.0}什么是魔改，{w=0.5}以及关于QQ群聊的一些信息{...}"
    else:
        "Gra 耐心地跟你解释了各种事情：\n{w=1.0}什么是魔改，{w=0.5}QQ怎么用，{w=0.5}以及关于QQ群聊的一些信息{...}"
    "你还了解到，{w=0.5}Gra 也是一名魔改作者，{w=0.5}而在这个群里还有好几位像 Gra 一样的魔改作者。"
    "你本来还想继续询问“该怎么做魔改”之类的更多疑问——\n{w=0.5}但你母亲却已经在催你去睡觉了。"
    nvl clear
    mc.nvl 'Gra，{w=0.25}我先不聊了，{w=0.5}我["妈" if has_phone else "母亲"]叫我睡觉了'
    gra.nvl "祝你好梦"
    "你躺在床上回想今天发生的一切，{w=0.5}心中充满了干劲，{w=0.5}很快就进入了梦乡。"
    "窗外繁星点点，{w=0.5}或许{w=0.25}象征着无数个明天吧。"

    menu:
        "未完待续{......}"
        "查看AI剧情":
            jump vibe_ch2
        "查看[yangsy]的剧情骨架":
            jump bone_ch2
        "返回主菜单":
            pass
        
    return