

label chplotadvice_yoosee:

    scene black with dissolve
    
    # ch0 internally jumps to ch1 → ch2 → ... ch11 → route branches → epilogue → return
    
    yoosee.comment "不用照搬历史\n确定人物性格和故事走向就行"

    yoosee.comment "漫展之后就从主线过渡到各个人物线上了\n所以主角是在这里要确定发展关系"
    yangsy.comment "可不可以每一次都进一部分可攻略角色的线（\n别一次漫展世界线就全岔开了（"
    yoosee.comment """
    看情况

    有的可能第一次就可以
    \n有的要第一次触发一些事件
    \n也可以比如第二次的时候没有触发条件就会断线这样


    总体可以分为普通线，作者线，攻略线三种

    普通线就是正常爱好者
    \n但是更偏向于普通玩家而不是深入魔改圈

    作者线就是成为魔改作者这样

    然后作者线也可以出发一些攻略角色

    攻略线更侧重感情

    魔改用于增添风味（）
    """

    return



label chplotadvice_yangsy:

    scene black with dissolve

    yangsy.comment """
    首先让大部分所有群员全都欢迎一句；可以顺便加点群员之间的互动

    然后各种小事发生时需要搞些选项能跟涉事成员交谈，提高进线可能

    自己的剧情自己写，写成啥样都没关系，后面会有人专门负责精修的

    等主角熟悉群内环境之后就可以安排全体打算让主角做个魔改试试水

    如果主角选择去尝试创作魔改，就让主角进创作者线，否则进普通线

    前者攻略Gra，Yangsy等创作者，后者攻略Morin，ms_win等普通成员

    也就是说要把攻略线拆成作者线和普通线的后续分支而不是平行时空

    然后就再来点什么其他的小事，依旧，跟涉事成员交谈提高进线可能

    不要直接让玩家直接选攻略谁，而是根据平时选了谁的选项自动决定

    两次漫展主要用于提供选项以判断正在攻略的角色；决定不了就共通

    螃蟹事件啊群聊解散啊这种刀子剧情虽说确实经历过但还是别写了（

    最终结局和二周目meta线就到时候再说了，这都不是现在的首要事项

    哦对如果你还没发现Yangsy每句长度都一样的话Yangsy会很失望的（
    
    当然游戏内的字体并不是等宽字体所以这点很难看出来就是了（（（
    """

    return
